---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange
source: html/303e4294-2dd6-8c2e-08b1-bbc0e379f60c.htm
---
# StructuralSectionISlopedFlange Members

Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters,
 used to attach to structural element.